{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_1": {"name": "input_layer_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/rescaling_1/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/rescaling_1/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "input_layer_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/Cast", "op": "Cast", "input": ["input_layer_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/rescaling_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/Cast", "StatefulPartitionedCall/functional_1/rescaling_1/Cast"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/rescaling_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/rescaling_1/mul", "StatefulPartitionedCall/functional_1/rescaling_1/Cast_1"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/rescaling_1/add"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/Cast"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/Cast_1", "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block1_pool_1/MaxPool2d", "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block2_pool_1/MaxPool2d", "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block3_pool_1/MaxPool2d", "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block4_pool_1/MaxPool2d", "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/Relu", "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/convolution", "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/vgg16_1/block5_pool_1/MaxPool2d"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Cast", "StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Mean"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Cast_1", "StatefulPartitionedCall/functional_1/dense_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/dense_1/MatMul", "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/dense_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1/Cast", "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/activation_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/activation_1/Relu", "StatefulPartitionedCall/functional_1/dense_1_2/Cast/Cast"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/dense_1_2/MatMul", "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1_2/Cast", "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul_1", "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/activation_1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1_2/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/activation_1_2/Relu", "StatefulPartitionedCall/functional_1/dense_2_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/dense_2_1/MatMul", "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/dense_2_1/Softmax"], "attr": {"T": {"type": "DT_HALF"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/rescaling_1/Cast", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/rescaling_1/Cast_1", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/convolution/Cast", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv1_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block1_conv2_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/convolution/Cast", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv1_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block2_conv2_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/convolution/Cast", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv1_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/convolution/Cast", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv2_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/convolution/Cast", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block3_conv3_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/convolution/Cast", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv1_1/Squeeze", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/convolution/Cast", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv2_1/Squeeze", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/convolution/Cast", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block4_conv3_1/Squeeze", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/convolution/Cast", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv1_1/Squeeze", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/convolution/Cast", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv2_1/Squeeze", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/convolution/Cast", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/vgg16_1/block5_conv3_1/Squeeze", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/global_average_pooling2d_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/Cast", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/Cast", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/Cast", "shape": [512, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/Cast", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/Cast", "shape": [256, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/Cast", "shape": [10], "dtype": "float32"}]}]}